import random # عشان نعرف نطلع أرقام عشوائية تمثل زحمة الجو والشوشرة اللي في الموجات

class SpectrumAnalyzer: # ده الجزء المسؤول عن محاكاة تحليل موجات الراديو في الجو
    """
    محاكاة لتحليل موجات الراديو في تردد الـ 2.4 جيجا هيرتز.
    بيطلع بيانات عن زحمة القنوات من 1 لـ 14.
    """
    @staticmethod # علامة بتخلينا نقدر نستخدم الطريقة دي من غير ما نجهز نسخة من الجزء ده
    def get_spectrum_data(): # دي الطريقة اللي بتجهز وبتحسب بيانات الترددات والزحمة في الجو
        # بنعمل أرقام عشوائية شكلها حقيقي بتمثل الشوشرة في القنوات اللاسلكية
        return [random.randint(10, 60) if i not in [1, 6, 11] else random.randint(40, 90) for i in range(14)] 
        # بنرجع مجموعة فيها 14 رقم بيمثلوا القنوات، وبنزود الزحمة في القنوات المشهورة (1 و 6 و 11) عشان تبان حقيقية

spectrum = SpectrumAnalyzer() # بنعمل نسخة جاهزة للاستخدام في أي مكان في السيستم بتاعنا